#### Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd
df = pd.DataFrame({
    "Name": ["akshay", "ranveer", "sunny", "anupam" ],
    "Number_of_film": [200, 360, 420, 700]
})

In [2]:
df.head()

      Name  Number_of_film
0   akshay             200
1  ranveer             360
2    sunny             420
3   anupam             700

In [30]:
df.describe()

       Number_of_film
count         4.00000
mean        420.00000
std         208.48661
min         200.00000
25%         320.00000
50%         390.00000
75%         490.00000
max         700.00000

In [31]:
df.columns

Index(['Name', 'Number_of_film'], dtype='object')

In [37]:
df.loc[0:2, ["Name", "Number_of_film"]]

      Name  Number_of_film
0   akshay             200
1  ranveer             360
2    sunny             420

In [38]:
df[["Name","Number_of_film"]]

   Number_of_film
0             200
1             360
2             420
3             700

In [5]:
df.iloc[0:2, [0,1]]

      Name  Number_of_film
0   akshay             200
1  ranveer             360

#### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
#### iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
#### function should print the sum to the console.
#### For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
#### calculate and print the sum of the first three values, which is 60.

In [7]:
def sum_values(df):
    sum_of_values = 0
    for i in range(3):
        sum_of_values += df["Values"][i]
        
    return sum_of_values
if __name__ == "__main__":
    df = pd.DataFrame({"Values": [10, 20, 30, 40, 50]})
    sum_of_values = sum_values(df)
    print(sum_of_values)

60

#### 4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
#### 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [17]:
def word_count(df):
    df["Word_Count"] = df["Text"].str.split().str.len()
    return df


if __name__ == "__main__":
    df = pd.DataFrame({"Text": ["This is a sentence.", "This is  the first sentence.", "This is the  second sentence."]})
    new_df = word_count(df)

In [18]:
new_df

                            Text  Word_Count
0            This is a sentence.           4
1   This is  the first sentence.           5
2  This is the  second sentence.           5

#### Q5. How are DataFrame.size() and DataFrame.shape() different?

In [23]:
df = pd.DataFrame({"a": [1,2,3,4],
                   "b": [9,8,7,6],
                   "c": [5,4,7,8],
                   "d":  [79,35,31,36]
})

In [24]:
df.size

16

In [25]:
df.shape

(4, 4)

### Q6. Which function of pandas do we use to read an excel file?

In [34]:
import pandas as pd

df = pd.read_excel("LUSID Excel - Setting up your market data.xlsx")

In [37]:
df.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,Datetimes in LUSID,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,This sheet allows you to format datetimes for...,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,If you have any questions please visit our:,NaN,NaN,NaN,NaN,NaN,NaN

#  Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
# all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
# function should return a new DataFrame that contains only the selected rows.

In [59]:
def rows(df):
    mask = (df["A"] > 5) &  (df["B"] <10)
    rows = df[mask]
    return rows
if __name__ == "__main__":
    df = pd.DataFrame({"A": [3, 8, 6, 2, 9, 8, 9, 9], 
                       "B": [5, 2, 9, 3, 1, 2, 1, 1],
                       "C": [1, 7, 4, 5, 2, 7, 2, 2]
})

In [60]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2
5  8  2  7
6  9  1  2
7  9  1  2

In [82]:
df.iloc[[1,4]]

   A  B  C
1  8  2  7
4  9  1  2

### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
###   median, and standard deviation of the values in the 'Values' column.

In [84]:
import pandas as pd

df = pd.DataFrame({'Values': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
})

In [86]:
df.mean()

Values    5.5
dtype: float64

In [89]:
df.median()

Values    5.5
dtype: float64

In [90]:
df.std()

Values    3.02765
dtype: float64

#### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
#### create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
#### for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
#### should include the current day.

In [103]:
def average(df):
    sales = df['Sales']
    date = df['Date']

    moving_average = sales.rolling(7).mean()

    df['MovingAverage'] = moving_average

    return df

In [104]:
import pandas as pd

df = pd.DataFrame({'Sales': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10], 'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08', '2023-01-09', '2023-01-10']
})
df = average(df)

In [105]:
df

   Sales        Date  MovingAverage
0      1  2023-01-01            NaN
1      2  2023-01-02            NaN
2      3  2023-01-03            NaN
3      4  2023-01-04            NaN
4      5  2023-01-05            NaN
5      6  2023-01-06            NaN
6      7  2023-01-07            4.0
7      8  2023-01-08            5.0
8      9  2023-01-09            6.0
9     10  2023-01-10            7.0

### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
### be imported?

In [6]:
import pandas as pd
df = pd.DataFrame({
  'Name': ['kumar', 'sumit', 'deepak'],
  'Age': [30, 25, 40]
})

In [7]:
df

     Name  Age
0   kumar   30
1   sumit   25
2  deepak   40

#### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
#### column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
#### Monday, Tuesday) corresponding to each date in the 'Date' column.

In [1]:
import pandas as pd
def add_Weekday_column(df,date_column):
    #convert the "date" column to pandas date time format
    df[date_column]= pd.to_datetime(df[date_column])
    
    #add a new column weekday containing weekday names
    df['Weekday'] = df[date_column].dt.strftime('%A')
    return df

In [3]:
import pandas as pd
# create a sample date frame
data = {'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']}
df = pd.DataFrame(data)

df = add_Weekday_column(df,'Date')

In [4]:
df

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday